text_answers = {
    "what_is_isup": (
        "🏗️ <b>ИСУП — ключ к эффективному управлению строительными проектами!</b>\n\n"

        "<b>1.🧑‍⚖️ Централизованный контроль:</b>\nВсе данные о проектах, объектах и документах собраны в одном месте, "
        "что позволяет легко отслеживать ходы выполнения работ, сроки и бюджеты. Вы всегда в курсе всех изменений и "
        "можете оперативно реагировать на любые ситуации.\n\n"

        "<b>2.⚙️ Автоматизация и снижение ошибок:</b>\nСистема автоматизирует многие рутинные процессы, такие как создание отчетов, "
        "обработка заявок, управление графиками. Это сокращает количество ошибок и повышает эффективность работы.\n\n"

        "<b>3.📄 Удобство документооборота:</b>\nВсе необходимые документы, такие как разрешения, акты, проектные документы, находятся "
        "в цифровом формате и могут быть быстро найдены и переданы заинтересованным сторонам. Это существенно ускоряет процесс "
        "утверждения и подписания документов.\n\n"

        "<b>4.🚀 Ускорение принятия решений:</b>\nИСУП предоставляет полную и актуальную информацию в реальном времени, что помогает вам "
        "принимать более быстрые и обоснованные решения на всех этапах проекта.\n\n"

        "<b>5.⚖️ Соответствие законодательству:</b>\nИСУП помогает соблюдать все требования законодательства, включая электронные подписи и "
        "обязательства по документообороту, что снижает риск штрафов и других юридических проблем.\n\n"

    ),
    "electronic_signature": (
        "Перед тем, как начать работу в разделе \"Модуль заказчика\", пользователь должен получить "
        "усиленную квалифицированную электронную подпись (далее - УКЭП). Без её наличия работа в \"Модуле заказчика\" невозможна.\n\n"

        "Квалифицированная электронная подпись (КЭП) нужна для того, чтобы придать документу юридическую значимость, "
        "то есть статус оригинала. Такой подписью подписывают налоговую отчётность, счета-фактуры, акты, накладные и иные документы.\n\n"

        "УКЭП, в соответствии с законодательством, является аналогом собственноручной подписи и может применяться во всех "
        "взаимоотношениях гражданско-правового характера. Данный вид электронной подписи применяется в рамках юридически значимого "
        "электронного документооборота.\n\n"

        "Порядок получения электронной подписи смотри на сайте: \n\n"
        "<a href='https://www.nalog.gov.ru/rn77/related_activities/ucfns/el_sign_getting/'>Федеральная налоговая служба</a>\n\n"

        "<b>Виды электронной подписи</b>\n"
        "<b>Электронная подпись руководителя</b>\n"
        "Данная усиленная квалифицированная электронная подпись открывается на физическое лицо с указанием юридического лица организации, "
        "которая выдает эту подпись.\n\n"

        "Основным отличием является то, что с таким видом подписи пользователю не нужна машиночитаемая доверенность (далее - МЧД).\n\n"

        "<b>Электронная подпись на физическое лицо</b>\n"
        "Данный вид усиленной квалифицированной электронной подписи отличается от предыдущего тем, что внутри такой подписи "
        "не указывается юридическое лицо организации, выдавшей подпись. С таким видом УКЭП необходимо создать машиночитаемую доверенность "
        "и, так же, как и УКЭП, внести в ИСУП.\n\n"

        "Обращаем ваше внимание, что ваша должность в рамках вашей организации никак не влияет на вид электронной подписи, которую вы получаете.\n\n"

        "<b>Получение УКЭП</b>\n"
        "Получение УКЭП зависит от организаций, которые занимаются выдачей подписей внутри регионов. "
        "Получение УКЭП - задача, которая решается внутри регионов и не связана с зоной ответственности ЦК РФ и ИСУП.\n\n"

        "<a href='https://www.nalog.gov.ru/'>Сайт ФНС России</a>\n\n"


        "<b>Проверка вида подписи</b>\n"
        "Как проверить, какой вид электронной подписи у вас?\n\n"
        "<a href='https://service.nalog.ru/dovel/#/'>Создание и проверка доверенности в электронной форме</a>\n\n"
        "После загрузки данных об УКЭП в ИСУП у вас появится сертификат. В нем есть две проверочные строки, "
        "чтобы понять, какого типа у вас УКЭП:\n"
        "- Наличие ИНН организации. Если ИНН есть - ваш УКЭП является подписью руководителя.\n"
        "- МЧД. Если ваша УКЭП является подписью руководителя - МЧД не требуется, если же МЧД требуется, значит ваша УКЭП не имеет указания юридического лица организации."
    )
    ,

    "add_object": "📩 Шаблоны направлять на email: isup@kgexpert.ru",

    "forgot_password": (
        "Обращаться на почту:\n 📩  isup@kgexpert.ru"
    ),
    "block_text": (
        "Для блокировки пользователя необходимо направить заявку на адрес электронной почты:\n\n 📩 isup@kgexpert.ru\n\n"
        "Существует 2 варианта направления заявки:\n"
        "1) Отправить сообщение на указанную электронную почту с официального адреса электронной почты Вашего учреждения, "
        "указав ФИО, должность и причину блокировки пользователя.\n"
        "2) Подготовить официальное письмо с указанием ФИО, должности и причины блокировки учетной записи пользователя, "
        "подписанное уполномоченным должностным лицом вашей организации, и направить его с любого адреса электронной почты."
    ),

    "instruction_text": (
        "Для проведения интеграции объекта в ИСУП с внешней информационной системой, "
        "которой будет пользоваться подрядчик по строительству или проектированию вашего объекта, "
        "необходимо выполнить следующие действия:\n\n"

        "1. Скачать приложенную форму, заполнить сведения о представителях застройщика, "
        "технического заказчика и строительного контроля, которым необходимо открыть доступ "
        "к модулю заказчика по объекту. В случае, если у кого-то из представителей отсутствует "
        "учетная запись в ИСУП, необходимо обратиться к шагу «Добавление пользователей».\n\n"

        "2. Направить заполненную форму на адрес электронной почты: \n📩 r.o.marchenko@depstroy.krasnodar.ru\n"
        "ВАЖНО! Указывайте в письме контактные данные сотрудника, с которым можно связаться "
        "по вопросам работы в модуле заказчика.\n\n"

        "3. Ожидать интеграции объекта с ВИС, обычно она занимает 2-5 рабочих дней."
    ),
    "tech_support": ("👨‍💻 При обращении в техническую поддержку ИСУП обязательно указывается наименование и ссылка на ОКС."
    "\nПример обращения для удаления некорректно загруженных томов проектной/рабочей документации в модуле заказчика:\n"
    "Название ОКС: «…»"
    "\nСсылка на ОКС: 🔗\nhttps://isup.roskapstroy.ru/dashboard/000/11/2222/654\n"
    "\nНеобходимо удалить следующие подгруженные тома проектной/рабочей документации по причине некорректной загрузки заказчиком:\n"
    "\nПД - 2020.2-ПЗ 1; 2020/2-ИЛО.4;\n"
    "РД - 2020/2-НВК; 2020_2-НВК"),

}
